Documents/упПересчетГрузовыхМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упПересчетГрузовыхМест</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиГрузовыхМест</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладскаяЯчейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрузовоеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГрузовыеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГрузов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упПересчетГрузовыхМест/Forms/ФормаПодбораОстатков/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Склад", Параметры.Склад, Истина);
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	мсвРезультатПодбора = Новый Массив;
	Для каждого Строка Из ВыбраннаяСтрока Цикл
		сткСтрока = Новый Структура("ГрузовоеМесто, Тара, СкладскаяЯчейка, Количество");
		ЗаполнитьЗначенияСвойств(сткСтрока, Элементы.Список.ДанныеСтроки(Строка));
		мсвРезультатПодбора.Добавить(сткСтрока);
	КонецЦикла;
	ОповеститьОВыборе(мсвРезультатПодбора); 
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	мсвРезультатПодбора = Новый Массив;
	Для каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		сткСтрока = Новый Структура("ГрузовоеМесто, Тара, СкладскаяЯчейка, Количество");
		ЗаполнитьЗначенияСвойств(сткСтрока, Элементы.Список.ДанныеСтроки(Строка));
		мсвРезультатПодбора.Добавить(сткСтрока);
	КонецЦикла;
	ОповеститьОВыборе(мсвРезультатПодбора); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции
	
#КонецОбласти
